"PayNow" = "Start payment process";

"PaymentProductsErrorExplanation" = "We are unable to retrieve the available payment products. \n\n Please check your internet connection and the provided client session identifier and customer identifier.";

"PaymentProductErrorExplanation" = "We are unable to retrieve information about the selected payment product. \n\n Please check your internet connection and the provided client session identifier and customer identifier.";

"PaymentProductNetworksErrorExplanation" = "We are unable to retrieve information about the selected payment product's networks. \n\n Please check your internet connection and the provided client session identifier and customer identifier.";

"SubmitErrorExplanation" = "We are unable to retrieve a key to encrypt your payment information. \n\n Please check your internet connection and the provided customer client session identifier and customer identifier.";

"ConnectionErrorTitle" = "Connection error";

"RememberMyDetails" = "Remember my payment details for future purchases";

"Pay" = "Pay";

"Cancel" = "Cancel";

"ContinueButtonTitle" = "Start another payment process";

"SuccessLabel" = "Congratulations!";

"SuccessText" = "Your payment has been successfully processed by the SDK.\n\nClick the button to show the resulting encrypted data that should be sent to Ingenico.";

"EncryptedDataResultLabel" = "Encrypted Customer Details";

"CopyEncryptedDataLabel" = "Copy to clipboard";

"SetupExplanation" = "To process a payment using the services provided by IngenicoConnect, the following information must be provided by a merchant.\n\nAfter providing the information requested below, this example app can process a payment.";

"ClientSessionIdentifier" = "Client session identifier";

"CustomerIdentifier" = "Customer identifier";

"MerchantIdentifier" = "Merchant identifier";

"Region" = "Region";

"Environment" = "Environment";

"AmountInCents" = "Amount in cents";

"CountryCode" = "Country code";

"CurrencyCode" = "Currency code";

"RecurringPayment" = "Payment is recurring";

"Paste" = "Paste JSON";

"Parse" = "Parse";

"JsonDialogMessage" = "Please paste the full JSON body as received via the Create Client Session API.";

"JsonPlaceholder" = "Paste JSON here:\n\n{\n\t\"assetUrl\" : \"\",\n\t\"clientApiUrl\" : \"\",\n\t\"clientSessionId\" : \"\",\n\t\"customerId\" : \"\",\n\t\"invalidTokens\" : \"\",\n\t\"region\" : \"\",\n}";

"JsonErrorMessage" = "Parsing failed, please provide a properly formatted JSON String";
